js216/stm32mp135-bootloader/src/eth.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file eth.h
 * @brief Ethernet test
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include "eth.h"
#include <stdint.h>

#ifdef ETHERNET
#include "board.h"

#include "irq.h"
#include "irq_ctrl.h"
#include "printf.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_def.h"
#include "stm32mp13xx_hal_eth.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_rcc.h"
#include <inttypes.h>
#include <string.h>

#if (USE_MCP23x17 == 1)
#include "stm32mp13xx_hal_i2c.h"
#include <stdbool.h>

/* MCP23x17 GPIO expander (EVB only).  Folded here because eth.c is its
 * only caller; keeping it separate caused cross-TU unusedFunction warnings. */
enum mcp_pin {
   MCP_PIN_0 = 0,
   MCP_PIN_1,
   MCP_PIN_2,
   MCP_PIN_3,
   MCP_PIN_4,
   MCP_PIN_5,
   MCP_PIN_6,
   MCP_PIN_7,
   MCP_PIN_8,
   MCP_PIN_9,
   MCP_PIN_10,
   MCP_PIN_11,
   MCP_PIN_12,
   MCP_PIN_13,
   MCP_PIN_14,
   MCP_PIN_15,
};

#define MCP_I2C_ADDR 0x21U
#define MCP_IODIRA   0x00U
#define MCP_IODIRB   0x01U
#define MCP_GPIOA    0x12U
#define MCP_GPIOB    0x13U

static I2C_HandleTypeDef mcp_hi2c;

static void mcp_init(void)
{
   GPIO_InitTypeDef g = {0};
   g.Mode             = GPIO_MODE_AF_OD;
   g.Pull             = GPIO_PULLUP;
   g.Speed            = GPIO_SPEED_FREQ_LOW;
   g.Alternate        = GPIO_AF5_I2C1;
   g.Pin              = GPIO_PIN_12;
   HAL_GPIO_Init(GPIOD, &g);
   g.Pin = GPIO_PIN_8;
   HAL_GPIO_Init(GPIOE, &g);
   __HAL_RCC_I2C1_CLK_ENABLE();
   /* 100 kHz @ 64 MHz: PRESC=7, SCLL=43, SCLH=35, SDADEL=2, SCLDEL=2 */
   mcp_hi2c.Instance = I2C1;
   mcp_hi2c.Init.Timing =
       (7U << 28U) | (2U << 20U) | (2U << 16U) | (35U << 8U) | 43U;
   mcp_hi2c.Init.OwnAddress1      = 0;
   mcp_hi2c.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
   mcp_hi2c.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
   mcp_hi2c.Init.OwnAddress2      = 0;
   mcp_hi2c.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
   mcp_hi2c.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
   mcp_hi2c.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
   if (HAL_I2C_Init(&mcp_hi2c) != HAL_OK)
      my_printf("mcp_init: HAL_I2C_Init failed\r\n");
}

static void mcp_set_pin_mode(enum mcp_pin pin, bool is_output)
{
   const uint8_t reg = (pin < 8) ? MCP_IODIRA : MCP_IODIRB;
   const uint8_t bit = (uint8_t)((uint8_t)pin % 8U);
   uint8_t val       = 0;
   if (HAL_I2C_Mem_Read(&mcp_hi2c, MCP_I2C_ADDR << 1U, reg,
                        I2C_MEMADD_SIZE_8BIT, &val, 1, 100) != HAL_OK) {
      my_printf("mcp_set_pin_mode: read failed\r\n");
      return;
   }
   if (is_output)
      val &= (uint8_t)~(uint8_t)(1U << bit);
   else
      val |= (uint8_t)(1U << bit);
   if (HAL_I2C_Mem_Write(&mcp_hi2c, MCP_I2C_ADDR << 1U, reg,
                         I2C_MEMADD_SIZE_8BIT, &val, 1, 100) != HAL_OK)
      my_printf("mcp_set_pin_mode: write failed\r\n");
}

static void mcp_pin_write(enum mcp_pin pin, bool is_high)
{
   const uint8_t reg = (pin < 8) ? MCP_GPIOA : MCP_GPIOB;
   const uint8_t bit = (uint8_t)((uint8_t)pin % 8U);
   uint8_t val       = 0;
   if (HAL_I2C_Mem_Read(&mcp_hi2c, MCP_I2C_ADDR << 1U, reg,
                        I2C_MEMADD_SIZE_8BIT, &val, 1, 100) != HAL_OK) {
      my_printf("mcp_pin_write: read failed\r\n");
      return;
   }
   if (is_high)
      val |= (uint8_t)(1U << bit);
   else
      val &= (uint8_t)~(uint8_t)(1U << bit);
   if (HAL_I2C_Mem_Write(&mcp_hi2c, MCP_I2C_ADDR << 1U, reg,
                         I2C_MEMADD_SIZE_8BIT, &val, 1, 100) != HAL_OK)
      my_printf("mcp_pin_write: write failed\r\n");
}
#endif /* USE_MCP23x17 */

#define ETH_MAC_ADDR0  0x00U
#define ETH_MAC_ADDR1  0x19U
#define ETH_MAC_ADDR2  0xB3U
#define ETH_MAC_ADDR3  0x12U
#define ETH_MAC_ADDR4  0x00U
#define ETH_MAC_ADDR5  0x00U
#define ETH_TIMEOUT_MS 1000U

#define LAN8742_ADDR              ((uint16_t)0x0000U)
#define LAN8742_BCR               ((uint16_t)0x0000U)
#define LAN8742_BSR               ((uint16_t)0x0001U)
#define LAN8742_PHYI1R            ((uint16_t)0x0002U)
#define LAN8742_PHYI2R            ((uint16_t)0x0003U)
#define LAN8742_PHYSMR            ((uint16_t)0x0012U)
#define LAN8742_PHYSCSR           ((uint16_t)0x001FU)
#define LAN8742_PHYSECR           ((uint16_t)0x001AU)
#define LAN8742_PHYSCSIR          ((uint16_t)0x001BU)
#define LAN8742_PHYISFR           ((uint16_t)0x001DU)
#define LAN8742_BCR_SOFT_RESET    ((uint16_t)0x8000U)
#define LAN8742_BCR_AUTONEGO_EN   ((uint16_t)0x1000U)
#define LAN8742_BSR_LINK_STATUS   ((uint16_t)0x0004U)
#define LAN8742_BSR_AUTONEGO_CPLT ((uint16_t)0x0020U)
#define LAN8742_PHYSCSR_10BT_HD   ((uint16_t)0x0004U)
#define LAN8742_PHYSCSR_10BT_FD   ((uint16_t)0x0014U)
#define LAN8742_PHYSCSR_100BTX_HD ((uint16_t)0x0008U)
#define LAN8742_PHYSCSR_100BTX_FD ((uint16_t)0x0018U)
#define LAN8742_PHYID1_EXPECT     ((uint16_t)0x0007U)
#define LAN8742_PHYID2_EXPECT     ((uint16_t)0xC131U)

// global variables
static ETH_HandleTypeDef eth_handle;
static ETH_TxPacketConfigTypeDef tx_conf;

// descriptors
__attribute__((
    aligned(32))) static ETH_DMADescTypeDef rx_dma_desc[ETH_RX_DESC_CNT];
__attribute__((
    aligned(32))) static ETH_DMADescTypeDef tx_dma_desc[ETH_TX_DESC_CNT];
__attribute__((aligned(32))) static uint8_t tx_buf[1536];
__attribute__((aligned(32))) static ETH_BufferTypeDef tx_buf_desc;

static void eth_pin_init(void)
{
   GPIO_InitTypeDef init = {0};
   init.Speed            = GPIO_SPEED_FREQ_HIGH;
   init.Mode             = GPIO_MODE_AF_PP;
   init.Pull             = GPIO_NOPULL;

#ifdef ETH_RX_CLK_PORT
   init.Pin       = ETH_RX_CLK_PIN;
   init.Alternate = ETH_RX_CLK_AF;
   HAL_GPIO_Init(ETH_RX_CLK_PORT, &init);
#endif

#ifdef ETH_CLK_PORT
   init.Pin       = ETH_CLK_PIN;
   init.Alternate = ETH_CLK_AF;
   HAL_GPIO_Init(ETH_CLK_PORT, &init);
#endif

   init.Pin       = ETH_MDIO_PIN;
   init.Alternate = ETH_MDIO_AF;
   HAL_GPIO_Init(ETH_MDIO_PORT, &init);

   init.Pin       = ETH_TX_EN_PIN;
   init.Alternate = ETH_TX_EN_AF;
   HAL_GPIO_Init(ETH_TX_EN_PORT, &init);

   init.Pin       = ETH_CRS_DV_PIN;
   init.Alternate = ETH_CRS_DV_AF;
   HAL_GPIO_Init(ETH_CRS_DV_PORT, &init);

   init.Pin       = ETH_RXD0_PIN;
   init.Alternate = ETH_RXD0_AF;
   HAL_GPIO_Init(ETH_RXD0_PORT, &init);

   init.Pin       = ETH_RXD1_PIN;
   init.Alternate = ETH_RXD1_AF;
   HAL_GPIO_Init(ETH_RXD1_PORT, &init);

   init.Pin       = ETH_MDC_PIN;
   init.Alternate = ETH_MDC_AF;
   HAL_GPIO_Init(ETH_MDC_PORT, &init);

   init.Pin       = ETH_TXD0_PIN;
   init.Alternate = ETH_TXD0_AF;
   HAL_GPIO_Init(ETH_TXD0_PORT, &init);

   init.Pin       = ETH_TXD1_PIN;
   init.Alternate = ETH_TXD1_AF;
   HAL_GPIO_Init(ETH_TXD1_PORT, &init);

#if (USE_MCP23x17 == 1)
   mcp_init();
   mcp_set_pin_mode(ETH_NRST_PIN, true);
   mcp_pin_write(ETH_NRST_PIN, true);
#else
   init.Speed = GPIO_SPEED_FREQ_LOW;
   init.Mode  = GPIO_MODE_OUTPUT_PP;
   init.Pin   = ETH_NRST_PIN;
   HAL_GPIO_Init(ETH_NRST_PORT, &init);
   HAL_GPIO_WritePin(ETH_NRST_PORT, ETH_NRST_PIN, GPIO_PIN_SET);
#endif
}

/**
 * @brief Initialize LAN8742 PHY over MDIO.
 *
 * Performs a software reset, enables auto-negotiation, and verifies
 * that the PHY responds over MDIO. Does not wait for link-up,
 * so can be called with no cable connected.
 *
 * @retval 0  PHY responded over MDIO, initialization complete.
 * @retval -1 MDIO access failed.
 */
static int eth_phy_init(void)
{
   uint32_t v   = 0;
   uint32_t id1 = 0;
   uint32_t id2 = 0;
   uint32_t t0  = 0;

   HAL_ETH_SetMDIOClockRange(&eth_handle);

   /* Reset PHY */
   if (HAL_ETH_WritePHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_BCR,
                                LAN8742_BCR_SOFT_RESET) != HAL_OK) {
      my_printf("PHY reset write failed\r\n");
      return -1;
   }

   /* Wait for reset to complete (typically a few ms) */
   t0 = HAL_GetTick();
   do {
      if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_BCR, &v) !=
          HAL_OK) {
         my_printf("PHY BCR read failed\r\n");
         return -1;
      }
      if ((HAL_GetTick() - t0) > ETH_TIMEOUT_MS) {
         my_printf("PHY reset timeout\r\n");
         return -1;
      }
   } while (v & LAN8742_BCR_SOFT_RESET);

   /* Enable auto-negotiation */
   v |= LAN8742_BCR_AUTONEGO_EN;
   if (HAL_ETH_WritePHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_BCR, v) !=
       HAL_OK) {
      my_printf("Enable auto-negotiation failed\r\n");
      return -1;
   }

   /* Optional: read PHY ID to verify MDIO communication */
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYI1R,
                               &id1) != HAL_OK ||
       HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYI2R,
                               &id2) != HAL_OK) {
      my_printf("PHY ID read failed\r\n");
      return -1;
   }

   // Check ID of the PHY is correct
   if ((id1 != LAN8742_PHYID1_EXPECT) || (id2 != LAN8742_PHYID2_EXPECT)) {
      my_printf("Unexpected PHY ID: 0x%04" PRIX32 " 0x%04" PRIX32 "\r\n", id1,
                id2);
      return -1;
   }

   return 0;
}

static void eth_desc_init(void)
{
   static uint8_t mac[6] = {
       ETH_MAC_ADDR0, ETH_MAC_ADDR1, ETH_MAC_ADDR2,
       ETH_MAC_ADDR3, ETH_MAC_ADDR4, ETH_MAC_ADDR5,
   };

   memset(&tx_conf, 0, sizeof(ETH_TxPacketConfigTypeDef));
   tx_conf.Attributes =
       ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
   tx_conf.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
   tx_conf.CRCPadCtrl   = ETH_CRC_PAD_INSERT;

   memset(&tx_buf_desc, 0, sizeof(tx_buf_desc));
   tx_buf_desc.buffer = tx_buf;
   tx_buf_desc.next   = NULL;
   tx_conf.TxBuffer   = &tx_buf_desc;

   eth_handle.Instance            = ETH;
   eth_handle.Init.MACAddr        = &mac[0];
   eth_handle.Init.MediaInterface = HAL_ETH_RMII_MODE;
   eth_handle.Init.TxDesc         = tx_dma_desc;
   eth_handle.Init.RxDesc         = rx_dma_desc;
   eth_handle.Init.RxBuffLen      = 1536;
   eth_handle.Init.ClockSelection = ETH_CLK_SRC;
}

void eth_init(void)
{
   eth_pin_init();

   __HAL_RCC_ETH1CK_CLK_ENABLE();
   __HAL_RCC_ETH1MAC_CLK_ENABLE();
   __HAL_RCC_ETH1TX_CLK_ENABLE();
   __HAL_RCC_ETH1RX_CLK_ENABLE();

   eth_desc_init();

   if (HAL_ETH_Init(&eth_handle) != HAL_OK) {
      my_printf("HAL_ETH_Init(&eth_handle) != HAL_OK\r\n");
      return;
   }

   IRQ_SetPriority(ETH1_IRQn, PRIO_ETH);
   IRQ_Enable(ETH1_IRQn);

   if (eth_phy_init() != 0) {
      my_printf("eth_phy_init() != 0\r\n");
      return;
   }

   HAL_ETH_Start(&eth_handle);
}

void eth_status(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc;
   (void)arg1;
   (void)arg2;
   (void)arg3;

   // Read Basic Control Register
   uint32_t bcr = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_BCR, &bcr) !=
       HAL_OK) {
      my_printf("PHY BCR read failed\r\n");
      return;
   }

   // Read Basic Status Register
   uint32_t v = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_BSR, &v) !=
       HAL_OK) {
      my_printf("PHY BSR read failed\r\n");
      return;
   }

   // Read Special Control/Status Register
   uint32_t phy_status = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYSCSR,
                               &phy_status) != HAL_OK) {
      my_printf("PHY PHYSCSR read failed\r\n");
      return;
   }

   // Read Interrupt Source Flag Register
   uint32_t isfr = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYISFR,
                               &isfr) != HAL_OK) {
      my_printf("PHY PHYISFR read failed\r\n");
      return;
   }

   // Read Special Modes Register
   uint32_t smr = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYSMR,
                               &smr) != HAL_OK) {
      my_printf("PHY PHYSMR read failed\r\n");
      return;
   }

   // Read Symbol Error Counter Register
   uint32_t secr = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYSCSR,
                               &secr) != HAL_OK) {
      my_printf("PHY PHYSECR read failed\r\n");
      return;
   }

   // Read Special Control/Status Indications Register
   uint32_t scsir = 0;
   if (HAL_ETH_ReadPHYRegister(&eth_handle, LAN8742_ADDR, LAN8742_PHYSCSR,
                               &scsir) != HAL_OK) {
      my_printf("PHY PHYSCSIR read failed\r\n");
      return;
   }

   if ((v & LAN8742_BSR_LINK_STATUS) == 0U) {
      my_printf("Link is down (no cable or remote inactive)\r\n");
      my_printf("  BCR = 0x%04" PRIX32 "\r\n", bcr);
      my_printf("  BSR = 0x%04" PRIX32 ", PHYSCSR = 0x%04" PRIX32 ", ", v,
                phy_status);
      my_printf("ISFR = 0x%04" PRIX32 ", ", isfr);
      my_printf("SMR = 0x%04" PRIX32 "\r\n", smr);
      my_printf("  SECR = 0x%04" PRIX32 ", ", secr);
      my_printf("SCSIR = 0x%04" PRIX32 ", ", scsir);
      my_printf("SYSCFG_PMCSETR = 0x%04" PRIX32 "\r\n", SYSCFG->PMCSETR);
      return;
   }

   // Determine speed
   const int speed_100 = (phy_status & (uint32_t)(LAN8742_PHYSCSR_100BTX_FD |
                                                  LAN8742_PHYSCSR_100BTX_HD))
                             ? 1
                             : 0;

   // Determine duplex
   const int full_duplex = (phy_status & (uint32_t)(LAN8742_PHYSCSR_10BT_FD |
                                                    LAN8742_PHYSCSR_100BTX_FD))
                               ? 1
                               : 0;

   // Print full status to user
   my_printf("Ethernet link is up\r\n");
   my_printf("  Speed: %s Mbps\r\n", speed_100 ? "100" : "10");
   my_printf("  Duplex: %s\r\n", full_duplex ? "full" : "half");

   my_printf("  BCR = 0x%04" PRIX32 "\r\n", bcr);
   my_printf("  BSR = 0x%04" PRIX32 ", PHYSCSR = 0x%04" PRIX32 ", ", v,
             phy_status);
   my_printf("ISFR = 0x%04" PRIX32 ", ", isfr);
   my_printf("SMR = 0x%04" PRIX32 "\r\n", smr);
   my_printf("  SECR = 0x%04" PRIX32 ", ", secr);
   my_printf("SCSIR = 0x%04" PRIX32 ", ", scsir);
   my_printf("SYSCFG_PMCSETR = 0x%04" PRIX32 "\r\n", SYSCFG->PMCSETR);
}

static uint16_t build_test_frame(uint8_t *buf)
{
   uint32_t i = 0;

   // Destination MAC: broadcast
   const uint8_t dst[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
   memcpy(&buf[i], dst, sizeof(dst));
   i += sizeof(dst);

   // Source MAC: our MAC
   const uint8_t src[6] = {ETH_MAC_ADDR0, ETH_MAC_ADDR1, ETH_MAC_ADDR2,
                           ETH_MAC_ADDR3, ETH_MAC_ADDR4, ETH_MAC_ADDR5};
   memcpy(&buf[i], src, sizeof(src));
   i += sizeof(src);

   // Ethertype
   const uint16_t ethertype = 0x88B5;
   buf[i++]                 = (uint8_t)(ethertype >> 8U);
   buf[i++]                 = (uint8_t)(ethertype & 0xFFU);

   // Payload
   const char msg[] = "STM32MP135 RAW ETH TEST";
   memcpy(&buf[i], msg, sizeof(msg) - 1);
   i += sizeof(msg) - 1;

   // Pad to minimum Ethernet frame length (60 bytes)
   while (i < 60) {
      buf[i++] = 0;
   }

   return (uint16_t)i;
}

void eth_send_test_frame(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc;
   (void)arg1;
   (void)arg2;
   (void)arg3;

   // Build frame in TX buffer
   const uint16_t len = build_test_frame(tx_buf);

   // Set up buffer descriptor
   tx_buf_desc.buffer = tx_buf;
   tx_buf_desc.len    = len;
   tx_buf_desc.next   = NULL;
   tx_conf.TxBuffer   = &tx_buf_desc;
   tx_conf.Length     = len;

   // Transmit
   if (HAL_ETH_Transmit(&eth_handle, &tx_conf, ETH_TIMEOUT_MS) != HAL_OK) {
      my_printf("HAL_ETH_Transmit failed\r\n");
      return;
   }

   my_printf("Test Ethernet frame sent\r\n");
}

#else // ETHERNET

void eth_init(void)
{
}

void eth_status(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc;
   (void)arg1;
   (void)arg2;
   (void)arg3;
}

void eth_send_test_frame(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc;
   (void)arg1;
   (void)arg2;
   (void)arg3;
}

#endif // ETHERNET

// end file eth.c
